# MeshTopologicalSortFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..MeshTopologicalSortFailed Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
Splitters and grids do not define a consistent rectangular mesh on the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MeshTopologicalSortFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MeshTopologicalSortFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MeshTopologicalSortFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace